src/app/controllers/chats_controller.rb

  def new
    @chat = Chat.new
    @mentor = Mentor.find(params[:mentor])    # grab mentor object from the mentor_id parameter that was passed to this URL
---
SELECT  "mentors".* FROM "mentors" WHERE "mentors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @chat = Chat.new(chat_params)
    @chat.student_id = current_user.student.id
    respond_to do |format|
      if @chat.save
---
INSERT INTO "chats" ("student_id", "mentor_id", "created_at", "updated_at", "studentName", "mentorName") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["student_id", 4], ["mentor_id", 1], ["created_at", "2019-11-25 10:02:14.457134"], ["updated_at", "2019-11-25 10:02:14.457134"], ["studentName", "John"], ["mentorName", "Brandon Hong"]]

  def destroy
    @chat.destroy
---
DELETE FROM "chats" WHERE "chats"."id" = $1  [["id", 12]]

    def set_chat
      @chat = Chat.find(params[:id])
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]