src/app/controllers/main_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    # if the user is signed in, pass the user id to this index view
    if params[:user]
      @user = User.find(params[:user])