src/app/controllers/mentors_controller.rb

SELECT "mentors".* FROM "mentors"
---
  def index
    @mentors = Mentor.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def show
    @email = User.find(@mentor.user_id_id).email

INSERT INTO "mentors" ("firstName", "lastName", "bio", "hourlyWage", "collegeName", "major", "collegeYear", "created_at", "updated_at", "user_id_id", "specialty") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @mentor = Mentor.new(mentor_params)
    @mentor.user_id_id = current_user.id
    respond_to do |format|
      if @mentor.save

SELECT  "mentors".* FROM "mentors" WHERE "mentors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_mentor
      @mentor = Mentor.find(params[:id])