src/app/controllers/messages_controller.rb

  def new
    @message = Message.new
    @chat = Chat.find(params[:chatId])
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("body", "chat_id", "created_at", "updated_at", "author") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hello, how are you?"], ["chat_id", 12], ["created_at", "2019-11-25 11:35:07.109390"], ["updated_at", "2019-11-25 11:35:07.109390"], ["author", "John"]]