src/app/controllers/students_controller.rb

  def show
    @mentors = Mentor.text_search(params[:query]).page(params[:page]).per_page(5)
    @user = User.find(@student.user_id_id)
---
SELECT COUNT(*) FROM "mentors" WHERE (mentors.firstName @@ 'brandon' or mentors.lastName @@ 'brandon' or mentors.bio @@ 'brandon' or mentors.hourlyWage @@ 'brandon' or mentors.collegeName @@ 'brandon' or mentors.specialty @@ 'brandon' or mentors.collegeYear @@ 'brandon')
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]

  def create
    @student = Student.new(student_params)
    @student.user_id_id = current_user.id   # link the student account to the user account before saving in database
    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "bio", "budget", "location", "created_at", "updated_at", "user_id_id", "weakestSubject", "favoriteSubject") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "budget" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["budget", "50.0"], ["updated_at", "2019-11-25 00:57:42.628351"], ["id", 4]]